using namespace std;
#include <cstdio>
#include <iostream>

int main(void)
{
		FILE* ter;
		char b[] = { 1,2,3 };
		fopen_s(&ter, "lol.txt", "wb");
		if (fopen_s(&ter, "lol.txt", "wb") == NULL)
			printf("Oops");
		else
			fwrite(&b, sizeof(char) * 3, 1, ter);
		fclose(ter);
		return 0;

}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
